//===================================================================
//
//	共通関数のヘッダー[function.h]
//	Author:Shugo Kuroda
//
//===================================================================
#ifndef _FUNCTION_H_			//このマクロ定義がされなかったら
#define _FUNCTION_H_			//2重インクルード防止のマクロ定義

//======================================================
//	プロトタイプ宣言
//======================================================
bool SphereCollision(D3DXVECTOR3 posStart, D3DXVECTOR3 posEnd, int StartLength, int EndLength);			//球体の当たり判定

#endif