//===================================================================
//
//		ライン処理のヘッダー[line.h]
//		Author:黒田 周吾
//
//===================================================================
#ifndef _LINE_H_			//このマクロ定義がされなかったら
#define _LINE_H_			//2重インクルード防止のマクロ定義

//======================================================
//	マクロ定義
//======================================================
#define MAX_LINE		(256)		//モデルの最大数

//======================================================
//	ラインの構造体定義
//======================================================
typedef struct
{
	D3DXVECTOR3 pos;				//位置
	D3DXVECTOR3 rot;				//回転
	D3DXMATRIX mtxWorld;			//ワールドマトリックス
	bool bUse;						//使用しているかどうか
}Line;

//======================================================
//	プロトタイプ宣言
//======================================================
void InitLine(void);
void UninitLine(void);
void UpdateLine(void);
void DrawLine(void);
void SetLine(D3DXVECTOR3 VtxMax, D3DXVECTOR3 VtxMin);
Line *GetLine(void);

#endif