//=============================================================================
//
// チュートリアル処理[tutorial.h]
// Author : 黒田 周吾
//
//=============================================================================
#ifndef _TUTORIAL_H_			//このマクロ定義がされなかったら
#define _TUTORIAL_H_			//2重インクルード防止のマクロ定義

//======================================================
//	マクロ定義
//======================================================
#define MAX_TUTORIAL		(2)			//チュートリアル画面で必要な画像数
#define TUTORIAL_SIZE_X		(900.0f)	//チュートリアルの大きさX
#define TUTORIAL_SIZE_Y		(150.0f)	//チュートリアルの大きさY

//======================================================
//	構造体定義
//======================================================
//typedef struct
//{
//	D3DXVECTOR3 pos;		//位置
//	D3DXVECTOR3 move;		//移動量
//}Title;
//======================================================
//	プロトタイプ宣言
//======================================================
void InitTutorial(void);
void UninitTutorial(void);
void UpdateTutorial(void);
void DrawTutorial(void);

#endif