//=============================================================================
//
//	ゲーム画面処理のヘッダーファイル[game.h]
//	Author : 黒田 周吾
//
//=============================================================================
#ifndef _GAME_H_			//このマクロ定義がされなかったら
#define _GAME_H_			//2重インクルード防止のマクロ定義

//======================================================
//	構造体
//======================================================
typedef struct
{
	int nCnt;		//出現カウンター
	bool bNot;		//カウンター加算防止
}LogoCount;

//======================================================
//	プロトタイプ宣言
//======================================================
void InitGame(void);
void UninitGame(void);
void UpdateGame(void);
void DrawGame(void);
LogoCount *GetLogoCount(void);

#endif