//===================================================================
//
//		ロード処理のヘッダー[load.h]
//		Author:黒田 周吾
//
//===================================================================
#ifndef _LOAD_H_			//このマクロ定義がされなかったら
#define _LOAD_H_			//2重インクルード防止のマクロ定義

//======================================================
//	プロトタイプ宣言
//======================================================
HRESULT LoadSetModel(HWND hWnd);
HRESULT LoadSetPlayer(HWND hWnd);
HRESULT LoadSetEnemy(HWND hWnd);

#endif