//=============================================================================
//
// タイトル処理のヘッダーファイル
// Author : 黒田 周吾
//
//=============================================================================
#ifndef _TITLE_H_			//このマクロ定義がされなかったら
#define _TITLE_H_			//2重インクルード防止のマクロ定義

//======================================================
//	マクロ定義
//======================================================
#define MAX_TITLE			(3)			//タイトル画面で必要な画像数
#define TITLE_SIZE_X		(900.0f)	//タイトルの大きさX
#define TITLE_SIZE_Y		(150.0f)	//タイトルの大きさY

//======================================================
//	構造体定義
//======================================================
typedef struct
{
	D3DXVECTOR3 pos;		//位置
	D3DXVECTOR3 move;		//移動量
}Title;
//======================================================
//	プロトタイプ宣言
//======================================================
void InitTitle(void);
void UninitTitle(void);
void UpdateTitle(void);
void DrawTitle(void);

#endif