//=============================================================================
//
//	ポーズ処理のヘッダーファイル
//	Author : 黒田 周吾
//
//=============================================================================
#ifndef _PAUSE_H_			//このマクロ定義がされなかったら
#define _PAUSE_H_			//2重インクルード防止のマクロ定義d

//======================================================
//	プロトタイプ宣言
//======================================================
void InitPause(void);
void UninitPause(void);
bool UpdatePause(void);
void DrawPause(void);

#endif