//=============================================================================
//
// チュートリアル処理[tutorial.h]
// Author : 黒田 周吾
//
//=============================================================================
#ifndef _TUTORIAL_H_			//このマクロ定義がされなかったら
#define _TUTORIAL_H_			//2重インクルード防止のマクロ定義

//======================================================
//	プロトタイプ宣言
//======================================================
void InitTutorial(void);
void UninitTutorial(void);
void UpdateTutorial(void);
void DrawTutorial(void);

#endif