//=============================================================================
//
// ゲーム画面のUIヘッダー[ui.h]
// Author : 黒田 周吾
//
//=============================================================================
#ifndef _UI_H_			//このマクロ定義がされなかったら
#define _UI_H_			//2重インクルード防止のマクロ定義

//======================================================
//	構造体定義
//======================================================
typedef struct
{
	D3DXVECTOR3 pos;		//位置
	D3DXVECTOR2 size;		//サイズ
	int nCntUse;			//表示する時間
	bool bUse;				//使用しているかどうか
}UI;
//======================================================
//	プロトタイプ宣言
//======================================================
void InitUI(void);
void UninitUI(void);
void UpdateUI(void);
void DrawUI(void);
void SetUI(D3DXVECTOR3 pos, D3DXVECTOR2 size, int nCntUse, int nCntUI);

#endif